<a href="https://colab.research.google.com/github/ayuksekdag/python_statistics/blob/main/chapter2.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd

In [2]:
df= pd.read_csv('https://raw.githubusercontent.com/ayuksekdag/python_statistics/main/Planets.csv',delimiter=';')
df

    Planet    Mass  Diameter  ... MagneticField FirstVisited  FirstMission
0  MERCURY    0,33  4879.000  ...           Yes   1974-03-29    Mariner 10
1    VENUS    4,87    12.104  ...            No   1962-08-27     Mariner 2
2    EARTH    5,97    12.756  ...           Yes          NaN           NaN
3     MOON   0,073  3475.000  ...            No   1959-09-12        Luna 2
4     MARS   0,642  6792.000  ...            No   1965-07-15     Mariner 4
5  JUPITER    1898   142.984  ...           Yes   1973-12-04    Pioneer 10
6   SATURN     568   120.536  ...           Yes   1979-09-01    Pioneer 11
7   URANUS    86,8    51.118  ...           Yes   1986-01-24     Voyager 2
8  NEPTUNE     102    49.528  ...           Yes   1989-08-25     Voyager 2
9    PLUTO  0,0146  2370.000  ...           NaN   2015-07-14  New Horizons

[10 rows x 14 columns]

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 14 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Planet           10 non-null     object
 1   Mass             10 non-null     object
 2   Diameter         10 non-null     float64
 3   DayLength        10 non-null     object
 4   SunDistance      9 non-null      object
 5   OrbitPeriod      10 non-null     object
 6   OrbitVelocity    10 non-null     object
 7   MeanTemperature  10 non-null     int64
 8   SurfacePressure  6 non-null      object
 9   Moons            10 non-null     int64
 10  Rings            10 non-null     object
 11  MagneticField    9 non-null      object
 12  FirstVisited     9 non-null      object
 13  FirstMission     9 non-null      object
dtypes: float64(1), int64(2), object(11)
memory usage: 1.2+ KB

In [4]:
df.shape

(10, 14)

In [ ]:
df.index

RangeIndex(start=0, stop=10, step=1)

In [5]:
df.set_index('Planet')

           Mass  Diameter DayLength  ... MagneticField FirstVisited  FirstMission
Planet                               ...
MERCURY    0,33  4879.000    4222,6  ...           Yes   1974-03-29    Mariner 10
VENUS      4,87    12.104      2802  ...            No   1962-08-27     Mariner 2
EARTH      5,97    12.756        24  ...           Yes          NaN           NaN
MOON      0,073  3475.000     708,7  ...            No   1959-09-12        Luna 2
MARS      0,642  6792.000      24,7  ...            No   1965-07-15     Mariner 4
JUPITER    1898   142.984       9,9  ...           Yes   1973-12-04    Pioneer 10
SATURN      568   120.536      10,7  ...           Yes   1979-09-01    Pioneer 11
URANUS     86,8    51.118      17,2  ...           Yes   1986-01-24     Voyager 2
NEPTUNE     102    49.528      16,1  ...           Yes   1989-08-25     Voyager 2
PLUTO    0,0146  2370.000     153,3  ...           NaN   2015-07-14  New Horizons

[10 rows x 13 columns]

In [9]:
df.loc[ df.Planet == 'VENUS']

  Planet  Mass  Diameter  ... MagneticField FirstVisited FirstMission
1  VENUS  4,87    12.104  ...            No   1962-08-27    Mariner 2

[1 rows x 14 columns]

In [10]:
df.loc[df.Rings == 'Yes' ]

    Planet  Mass  Diameter  ... MagneticField FirstVisited FirstMission
5  JUPITER  1898   142.984  ...           Yes   1973-12-04   Pioneer 10
6   SATURN   568   120.536  ...           Yes   1979-09-01   Pioneer 11
7   URANUS  86,8    51.118  ...           Yes   1986-01-24    Voyager 2
8  NEPTUNE   102    49.528  ...           Yes   1989-08-25    Voyager 2

[4 rows x 14 columns]

In [16]:
df.loc[ (df.Rings == 'No') & (df.MagneticField =='Yes') ]

    Planet  Mass  Diameter  ... MagneticField FirstVisited FirstMission
0  MERCURY  0,33  4879.000  ...           Yes   1974-03-29   Mariner 10
2    EARTH  5,97    12.756  ...           Yes          NaN          NaN

[2 rows x 14 columns]

In [ ]:
df.Planet

0    MERCURY
1      VENUS
2      EARTH
3       MOON
4       MARS
5    JUPITER
6     SATURN
7     URANUS
8    NEPTUNE
9      PLUTO
Name: Planet, dtype: object

In [ ]:
df['FirstVisited']

0    1974-03-29
1    1962-08-27
2           NaN
3    1959-09-12
4    1965-07-15
5    1973-12-04
6    1979-09-01
7    1986-01-24
8    1989-08-25
9    2015-07-14
Name: FirstVisited, dtype: object

In [ ]:
df.loc[1]

Planet                  VENUS
Mass                     4,87
Diameter               12.104
DayLength                2802
SunDistance             108,2
OrbitPeriod             224,7
OrbitVelocity              35
MeanTemperature           464
SurfacePressure            92
Moons                       0
Rings                      No
MagneticField              No
FirstVisited       1962-08-27
FirstMission        Mariner 2
Name: 1, dtype: object